---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.PanelMismatchCircuitType
source: html/0bc392e0-5945-8558-fd80-981978fedfa2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.PanelMismatchCircuitType Property

Cannot assign [Element] to Circuit. The Type for the panel does not match the Type ([Name]) for the Circuit.

## Syntax (C#)
```csharp
public static FailureDefinitionId PanelMismatchCircuitType { get; }
```